{
  "backend/main.mo": "Main backend actor implementing a construction project management system with user profiles, projects, permits, crew, tasks, materials, change orders, and safety incidents. Includes authorization mixins and blob storage for comprehensive project tracking.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: authentication system debugging (REQ-18) and landing page redesign (REQ-19), with associated files and component dependencies.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration for the SayWattPM construction management application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for construction-themed UI with warm oranges, charcoal grays, and safety yellow.",
  "frontend/index.html": "HTML entry point for the SayWattPM application with root div and TypeScript module script reference.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup that conditionally renders Landing page for unauthenticated users, ProfileSetup modal for new users, or AppLayout with dashboard/project routes for authenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable authentication button component handling Internet Identity login/logout with loading states, error handling, and appropriate icons/text based on authentication status.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal dialog for first-time user profile setup collecting name, role, email, and phone with form validation and non-dismissible behavior until completion.",
  "frontend/src/components/layout/AppLayout.tsx": "Main authenticated layout with sticky header containing logo, user profile display, navigation buttons, logout functionality, footer with attribution, and floating voice input button.",
  "frontend/src/components/materials/MaterialCostTracker.tsx": "React component that displays project budget summary (total, spent, remaining) with a burn rate progress bar, and provides a form to log material purchases with item, quantity, unit cost, and supplier fields.",
  "frontend/src/components/projects/CreateProjectDialog.tsx": "Dialog component with a form to create new electrical projects, capturing name, location, client name, general contractor, project value, and notes fields.",
  "frontend/src/components/safety/SafetyIncidentLog.tsx": "Component that displays a list of safety incidents for a project and provides a form to report new incidents with description and reporter name fields.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, projects, material purchases, change orders, safety incidents, and tasks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with construction-themed color variables (orange, charcoal, safety yellow) using OKLCH color space, dark mode support, and utilities for high-contrast outdoor visibility and large touch targets for field use.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying project overview, pending tasks sorted by urgency, and change orders with color-coded badges based on due dates. Includes a hero section and quick stats cards with a create project dialog.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature cards highlighting voice-activated logging, smart scheduling, and safety tracking, plus pricing tiers and footer with social links. Designed for electrical contractors with construction-themed visuals.",
  "frontend/src/pages/ProjectDetail.tsx": "Detailed project view page showing project information, budget tracking with burn rate calculation, material purchases, and safety incidents organized in tabs. Includes navigation back to dashboard and status badges.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with construction-themed colors using OKLCH, custom typography settings for readability, large touch targets, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for SayWattPM, a voice-first project management app for electrical contractors with features including crew management, permit tracking, material cost tracking, safety incident logging, and multi-tier freemium monetization. Contains known authentication and landing page issues that need fixing."
}