{
  "backend/main.mo": "Main backend actor implementing construction project management with access control, blob storage, user profiles, projects, permits, crew members, tasks, material purchases, change orders, and safety incidents with CRUD operations and authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Privacy, Terms, and Support pages with routing, construction-themed design, and footer navigation links on the Landing page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, components, pages, hooks, and styling with construction-themed design and voice input functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark mode construction-themed color variables including oranges, charcoals, and safety yellow.",
  "frontend/index.html": "HTML entry point for SayWattPM application with root div and TypeScript module script reference.",
  "frontend/src/App.tsx": "Main app component with TanStack Router configuration defining public routes (Landing, Privacy, Terms, Support) and authenticated routes (Dashboard, ProjectDetail) with profile setup flow and loading states.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable authentication button handling Internet Identity login/logout with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal dialog for first-time user profile setup collecting name, role, email, and phone with form validation and non-dismissible behavior until completion.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with header (logo, user profile, home/logout buttons), footer with attribution link, and a floating voice input button. Uses React Router's Outlet for nested routes and manages authentication state.",
  "frontend/src/components/materials/MaterialCostTracker.tsx": "Component for tracking material purchases against project budget, displaying budget summary with burn rate visualization, and providing a form to log new material purchases with item, quantity, unit cost, and supplier details.",
  "frontend/src/components/projects/CreateProjectDialog.tsx": "Dialog component for creating new electrical projects with form fields for name, location, client name, general contractor, project value, and notes. Handles form submission and validation.",
  "frontend/src/components/safety/SafetyIncidentLog.tsx": "Component for logging and displaying safety incidents on a project, with a form to report new incidents including description and reporter name, and a list view of existing incidents with timestamps.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and identity provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating data including user profiles, projects, material purchases, change orders, safety incidents, and tasks. Each hook uses the actor from useActor to call backend canister methods and manages query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom construction-themed design tokens using OKLCH color space (orange primary, charcoal gray secondary, safety yellow destructive). Includes dark mode support, high-contrast styling for outdoor visibility, and large touch targets for field use.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying active projects, pending tasks, and change orders with urgency indicators. Includes a hero section with background image, quick stats cards, and a CreateProjectDialog component.",
  "frontend/src/pages/Landing.tsx": "Marketing landing page showcasing SayWattPM features (voice logging, scheduling, safety, cost tracking) with hero section, feature cards, and social media links. Includes LoginButton for authentication.",
  "frontend/src/pages/Privacy.tsx": "Privacy policy page explaining data collection, usage, storage on Internet Computer blockchain, and security measures. Includes navigation back to home and structured sections for different privacy topics.",
  "frontend/src/pages/ProjectDetail.tsx": "Project detail page showing comprehensive project information including overview, material purchases, and safety incidents in tabs. Displays budget tracking, burn rate calculations, and integrates MaterialCostTracker and SafetyIncidentLog components.",
  "frontend/src/pages/Support.tsx": "Support page component displaying contact information (email, phone), FAQs about voice commands and features, and links to documentation and community resources with a back-to-home navigation header.",
  "frontend/src/pages/Terms.tsx": "Terms of Service page component outlining user agreements, service usage rules, voice data handling, prohibited activities, and legal terms with a back-to-home navigation header.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space (including construction-themed colors), typography settings, spacing, border radius, and responsive container settings with dark mode support.",
  "project_state.json": "Project state document defining SayWattPM as a voice-first electrical project management app with architectural notes on features (crew tracking, weather integration, CarPlay support, NEC compliance), known issues (login problems, landing page UX), and existing feature implementations."
}